Autodesk.Navisworks.Api.Schema.SchemaBuilder
Enables construction of SchemaDefinitions.

Autodesk.Navisworks.Api.Schema.SchemaBuilder.#ctor
Default constructor.

Autodesk.Navisworks.Api.Schema.SchemaBuilder.AddConcept(System.String)
Adds a given concept string onto the schema definition under construction.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Schema.SchemaBuilder.AddField(Autodesk.Navisworks.Api.Schema.Field)
Copies & adds in the field to the builder's internal collection.
Throws System.ArgumentException:
Provided field ID is invalid or missing. 7-bit ASCII without spaces must be used.
Throws System.ArgumentException:
Provided field ID is already in use.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'field' is null
Throws System.ArgumentException:
Argument 'field' has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaBuilder.BuildDefinition
Constructs a schema definition matching what has been passed into Autodesk.Navisworks.Api.Schema.SchemaBuilder.AddField(Autodesk.Navisworks.Api.Schema.Field) & Autodesk.Navisworks.Api.Schema.SchemaBuilder.AddConcept(System.String).
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Schema.SchemaBuilder.IsReadOnly
Gets a value indicating whether the object is read-only.